# Taps
tap 'homebrew/bundle'
tap 'sdkman/tap'
# tap 'stripe/stripe-cli'

# Cask setup
cask_args appdir: '~/Applications' , fontdir: '~/Library/Fonts' #, require_sha: true

# Common tools
brew 'autoenv'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'binutils'
brew 'coreutils'
brew 'curl'
brew 'ffmpeg'
brew 'findutils'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'glances'
brew 'gnupg'
brew 'grep'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'k6'
brew 'mas'
brew 'moreutils'
brew 'nvm'
brew 'openssh'
brew 'sdkman/tap/sdkman-cli'
brew 'stow'
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
brew 'tre'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Casks
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'pearcleaner'
cask 'rectangle'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'

# Cask - Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'

# Mac App Store 
mas 'Bear', id: 1091189122
mas 'Xcode', id: 497799835

# vscode extensions
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grafana.grafana-vscode"
vscode "hashicorp.terraform"
vscode "k--kato.intellij-idea-keybindings"
vscode "k6.k6"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "neo4j-extensions.neo4j-for-vscode"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "sonarsource.sonarlint-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "well-ar.vscode-wiremock"
vscode "yzhang.markdown-all-in-one"
